[
  {
    "date": "Nov 2024 - Present",
    "title": "Executive, Data Analyst",
    "org": "Building Construction Authority",
    "bullets": [
      "Architected enterprise Power BI governance serving 160+ officers with role-based access, MFA enforcement, and automated compliance monitoring - achieving 95% reduction in security incidents.",
      "Built end-to-end FormSG automation workflows handling national survey data with 99% uptime during critical collection periods, reducing manual processing by 40%.",
      "Designed cross-agency analytics platform processing SkillsFuture and CAW datasets for multiple government agencies while maintaining strict data classification and audit requirements.",
      "Developed security frameworks now serving as templates for government-wide analytics initiatives, demonstrating that enterprise-grade security and operational efficiency aren't mutually exclusive."
    ]
  },
  {
    "date": "Aug 2024 - Oct 2024",  
    "title": "Cybersecurity Skills Development",
    "org": "Self-Directed Learning & Certification",
    "bullets": [
      "Earned Certified Ethical Hacker (CEH) certification through 200+ hours of hands-on penetration testing labs covering reconnaissance to post-exploitation techniques.",
      "Completed Google Cybersecurity Professional Certificate with focus on incident response, threat analysis, and security frameworks applicable to government environments.", 
      "Built comprehensive home lab environment with Cisco equipment for CCNA preparation, implementing network security hardening and monitoring solutions.",
      "Integrated cybersecurity methodologies with existing automation and analytics expertise, creating unique cross-functional security engineering capabilities."
    ]
  },
  {
    "date": "Jun 2024 - Sep 2024",
    "title": "UAT Tester",
    "org": "Central Provident Fund Board",
    "bullets": [
      "Authored 40 end-to-end test scripts for new CAPI releases and surfaced 95 defects prior to production cutover.",
      "Built UiPath helpers that shortened regression runs by about 40% while keeping evidence collection traceable.",
      "Aligned acceptance gates with survey ops to ensure field teams received reliable tooling on day one."
    ]
  },
  {
    "date": "Aug 2020 - Dec 2022",
    "title": "Radar Operator Officer",
    "org": "Singapore Police Force",
    "bullets": [
      "Monitored a 25 nautical mile maritime zone, escalating an average of 12 actionable incidents per month for interception.",
      "Maintained radar readiness through preventive maintenance and shift SOPs, keeping systems available for 24/7 operations.",
      "Safeguarded Singapore Territorial Waters as part of a port ecosystem handling ~140,000 vessel movements yearly, supporting the economy’s tax-friendly maritime hub and Tuas Mega Port ambitions."
    ]
  },
  {
    "date": "Feb 2020 - Jul 2020",
    "title": "Information Technology Officer",
    "org": "Ministry of Manpower",
    "bullets": [
      "Facilitated 15 automation clinics and translated needs into UiPath workflows, saving an estimated 120 staff hours per quarter.",
      "Awarded testimonial for dependable delivery and stakeholder support."
    ]
  },
  {
    "date": "Jul 2019 - Feb 2020",
    "title": "Software Engineer",
    "org": "Government Technology Agency",
    "bullets": [
      "Built UiPath automations processing 5,000+ SG Work Pass records per run and packaged video training for non-IT teams.",
      "Managed licensing, UAT, and post-implementation support while scripting data-handling automations for a blockchain pilot.",
      "Recognized with a service testimonial for cross-agency support."
    ]
  },
  {
    "date": "May 2016 - Dec 2016",
    "title": "Desktop Support Engineer",
    "org": "NCS Pte Ltd",
    "bullets": [
      "Delivered enterprise IT support for 200+ users across multiple locations, achieving 96% customer satisfaction through systematic troubleshooting and professional service delivery.",
      "Led hardware refresh initiative for 50+ workstations, developing streamlined imaging and deployment procedures that reduced setup time by 40%.",
      "Implemented barcode-based asset tracking system improving inventory accuracy from 85% to 98%, providing foundation for better IT asset management.",
      "Created comprehensive network topology documentation and user training materials, establishing documentation practices that supported team knowledge sharing."
    ]
  },
  {
    "date": "Jan 2016 - Apr 2016",
    "title": "Final Year Project: Student Information System",
    "org": "Polytechnic Capstone Project", 
    "bullets": [
      "Designed and built comprehensive student information system with web portal and Android mobile application, demonstrating full-stack development capabilities.",
      "Implemented secure authentication, RESTful APIs, and responsive UI/UX design serving as foundation for later enterprise application development skills.",
      "Managed complete project lifecycle from requirements gathering through deployment, developing project management and stakeholder communication abilities.",
      "Delivered technical presentations to academic and industry panels, building confidence in explaining complex technical concepts to diverse audiences."
    ]
  },
  {
    "date": "Jun 2015 - Dec 2015", 
    "title": "IT Support Intern",
    "org": "Regional IT Services Provider",
    "bullets": [
      "Provided desktop support and network troubleshooting for 200+ employees, gaining first exposure to enterprise IT operations and customer service excellence.",
      "Assisted with software installations, hardware maintenance, and user training, developing systematic approach to technical problem-solving.",
      "Learned Active Directory administration, Windows domain management, and basic networking concepts that became foundation for later automation work.",
      "Documented common issues and solutions, beginning to understand the importance of knowledge management in technical operations."
    ]
  },
  {
    "date": "Apr 2014 - May 2016",
    "title": "Diploma in Information Technology",
    "org": "Singapore Polytechnic",
    "bullets": [
      "Specialized in software development and network administration with strong foundation in database design, web technologies, and system administration.",
      "Developed practical programming skills in Java, PHP, JavaScript, and C# through project-based learning that emphasized real-world application development.",
      "Gained hands-on experience with Cisco networking equipment, Windows/Linux system administration, and database management (MySQL, SQL Server).",
      "Led multiple group projects including Android app development and web application design, building teamwork and technical leadership capabilities.",
      "Transitioned from struggling with abstract theoretical concepts to excelling in practical, hands-on technical work that connected directly to industry needs."
    ]
  }
]
